In [21]:
import pandas as pd

In [22]:
t = pd.DataFrame()

In [23]:
t['A']=[1,2,3,4]
t

   A
0  1
1  2
2  3
3  4

In [24]:
t['B']=7
t

   A  B
0  1  7
1  2  7
2  3  7
3  4  7

In [26]:
t['C']=[7,7,7,7]
t

   A  B  C
0  1  7  7
1  2  7  7
2  3  7  7
3  4  7  7

In [27]:
type(t.B)

pandas.core.series.Series

In [15]:
type(t['B'])

pandas.core.series.Series

In [28]:
t[['B']]

   B
0  7
1  7
2  7
3  7

In [29]:
type(t[['B']])

pandas.core.frame.DataFrame

In [31]:
t['D']=[7,7,7,7]
t

   A  B  C  D
0  1  7  7  7
1  2  7  7  7
2  3  7  7  7
3  4  7  7  7

In [39]:
t.index = ['a','b','c','d']
t

   A  B  C  D
a  1  7  7  7
b  2  7  7  7
c  3  7  7  7
d  4  7  7  7

In [40]:
t.loc[['b', 'c'], ['A', 'D']]

   A  D
b  2  7
c  3  7

In [41]:
t['b':'c'] [['A', 'D']]

   A  D
b  2  7
c  3  7

In [42]:
t[['A', 'D']] ['b':'c']

   A  D
b  2  7
c  3  7

In [43]:
data = t
data

   A  B  C  D
a  1  7  7  7
b  2  7  7  7
c  3  7  7  7
d  4  7  7  7

In [44]:
data.iloc[-1]

A    4
B    7
C    7
D    7
Name: d, dtype: int64

In [48]:
x = {'A':1, 'B':2}

In [49]:
x

{'A': 1, 'B': 2}

In [50]:
type(x)

dict

In [56]:
x = {'A':1, 'B':2, 'C':3}

In [57]:
x

{'A': 1, 'B': 2, 'C': 3}

In [64]:
y = x['C']
y

3

In [66]:
x = [1,2,3,4]
x

[1, 2, 3, 4]

In [68]:
y = [i +1 for i in x]
y

[2, 3, 4, 5]

In [69]:
type(y)

list

In [70]:
x = ['amazon', 'berkshire', 'Cisco', 'Dell']

y = [s.capitalize() for s in x if s[1]=='e']

In [71]:
y

['Berkshire', 'Dell']

In [72]:
x = ['a', 'b', 'c', 'd']
y = [1, 2, 3]
z = []

In [73]:
len(x)

4

In [87]:
for i in range(len(x)):
    print(i)

0
1
2
3

In [102]:
x = ['a', 'b', 'c', 'd']
y = [1, 2, 3]
z = []

for i in range(len(x)):
    a = x[i] + str(y[-i])
    z += [a]

In [103]:
z

['a1', 'b3', 'c2', 'd1']